{
  "backend/main.mo": "Motoko canister with user profile auth, single-product storage, and CRUD operations gated by AccessControl and mixins.",
  "feature_evidence.json": "Empty feature evidence report structure.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files for reference.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and base styles.",
  "frontend/index.html": "HTML entry point loading the React app and PWA metadata.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, colors, and startup behavior.",
  "frontend/src/App.tsx": "Main React router configuration for storefront and admin routes with theming and toasts.",
  "frontend/src/components/admin/AdminLayout.tsx": "Admin layout with header navigation, login, profile setup, main outlet, and footer.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Protects admin routes by checking Internet Identity auth and admin permissions.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with loading states and cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting authenticated users to set up their admin profile name.",
  "frontend/src/components/checkout/CheckoutForm.tsx": "Checkout form handling customer info, validation, payment selection, and order creation via mutation.",
  "frontend/src/components/storefront/LoadableProductImage.tsx": "Image component that preloads product images and shows a placeholder until loading completes or fails.",
  "frontend/src/components/storefront/ProductCard.tsx": "Displays a product card with image, name, description, price, and availability, linking to the product page.",
  "frontend/src/components/storefront/ProductImageGallery.tsx": "Renders a main product image with selectable thumbnails, falling back to a placeholder when needed.",
  "frontend/src/components/storefront/QuantityStepper.tsx": "UI control for incrementing or decrementing a numeric quantity within optional bounds.",
  "frontend/src/components/storefront/StorefrontLayout.tsx": "Main storefront layout with header, navigation, cart indicator, and responsive mobile menu.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAdmin.ts": "Admin-oriented hooks for checking admin status and performing product and order mutations using the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity login, storing identities, and tracking login status.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls with React Query hooks for products, orders, and user profiles, including mutations and cache invalidation.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes with gold-accented color palettes.",
  "frontend/src/lib/deliveryFee.ts": "Contains delivery fee utilities, currently returning a flat fee of 200 Rs per order.",
  "frontend/src/lib/orderStatus.ts": "Maps order status values to display labels and badge variants for UI rendering.",
  "frontend/src/lib/payment.ts": "Provides payment method labels, manual payment helpers, and EasyPaisa/JazzCash instructions.",
  "frontend/src/lib/whatsapp.ts": "Builds WhatsApp-ready order messages and links based on order details and payment method.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider wrappers.",
  "frontend/src/pages/admin/AdminOrderDetailsPage.tsx": "Admin view for a single order with controls to verify payment, confirm, deliver, or cancel the order.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Lists all orders for admins with customer info, totals, status, and navigation to order details.",
  "frontend/src/pages/admin/AdminProductEditPage.tsx": "Form for creating or editing a product with fields for name, description, price, images, and active status.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin product list with images, price, status, and actions to create, edit, or deactivate products.",
  "frontend/src/pages/CartPage.tsx": "Renders the shopping cart UI, allowing quantity changes, item removal, and showing an order summary.",
  "frontend/src/pages/CatalogPage.tsx": "Displays the product catalog with loading and error states using data from active products query.",
  "frontend/src/pages/CheckoutPage.tsx": "Shows the checkout form when the cart has items and redirects empty carts back to the catalog.",
  "frontend/src/pages/HomePage.tsx": "Home page with hero banner and feature sections linking users to the product catalog.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays order confirmation details, customer info, items, and payment summary with WhatsApp contact and fallback states.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Fetches and shows product details with image gallery, quantity selector, and add‑to‑cart functionality.",
  "frontend/src/state/cart.ts": "Implements a persistent Zustand store for cart items with add, remove, quantity update, total, and count helpers.",
  "frontend/src/utils/productImages.ts": "Provides utilities for normalizing product image URLs and overriding images for specific known products.",
  "frontend/src/utils/urlParams.ts": "Handles reading, storing, and clearing URL parameters with sessionStorage support and hash-based routing compatibility.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, animations, typography, container queries, and theme extensions.",
  "project_state.json": "Describes the project's current state, goals, constraints, known issues, and product catalog details for the iMazu PWA."
}