{
  "backend/main.mo": "Primary backend canister handling authorization, user profiles, and full product CRUD with admin‑restricted mutations and public product queries.",
  "backend/migration.mo": "Migration module that transforms old actor state, updating images for one specific product while preserving all other data.",
  "feature_evidence.json": "Feature evidence record describing required storefront behavior for product image sourcing and listing related frontend files.",
  "frontend-file-summaries.txt": "Aggregated summaries of numerous frontend files describing app structure, hooks, components, and behavior.",
  "frontend/index.css": "Tailwind CSS base definitions with custom light/dark theme CSS variables for UI styling.",
  "frontend/index.html": "Base HTML entrypoint loading the React app with metadata, manifest, and icons.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, colors, and launch behavior.",
  "frontend/src/App.tsx": "React router configuration defining storefront and admin routes wrapped with theme provider and toaster.",
  "frontend/src/components/admin/AdminLayout.tsx": "Admin layout containing header navigation, login/profile setup, main outlet, and footer.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Route guard that enforces admin authentication with loading, login-required, and access-denied states.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity, handling auth flow and error recovery.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting authenticated users with no profile to enter and save their name.",
  "frontend/src/components/checkout/CheckoutForm.tsx": "Checkout form collecting customer info, validating input, creating orders, and handling payments.",
  "frontend/src/components/storefront/ProductCard.tsx": "Displays a product with image, name, description, price, and availability badge linking to details.",
  "frontend/src/components/storefront/ProductImageGallery.tsx": "Product image gallery with main image, thumbnails, fallback handling, and selection state.",
  "frontend/src/components/storefront/QuantityStepper.tsx": "Stepper component to increment or decrement quantity within min/max limits.",
  "frontend/src/components/storefront/StorefrontLayout.tsx": "Main storefront layout with header, navigation, mobile menu, and cart badge.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useAdmin.ts": "Admin-focused hooks for checking admin status and managing products and orders via actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling login, logout, and identity loading. Wraps AuthClient setup and exposes login state flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching products, orders, and user profiles, and for creating orders and saving profiles. Integrates backend actor calls with caching and image normalization.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables and base styles. Includes custom color tokens and utility classes.",
  "frontend/src/lib/deliveryFee.ts": "Calculates delivery fees, offering free delivery when the cart contains only a specific product. Defaults to a standard fee otherwise.",
  "frontend/src/lib/orderStatus.ts": "Maps order status values to human-readable labels and badge variants for UI display.",
  "frontend/src/lib/payment.ts": "Defines payment method labels, helper checks for manual payments, and constants for payment instructions.",
  "frontend/src/lib/whatsapp.ts": "Builds formatted WhatsApp order messages and generates shareable WhatsApp links. Includes logic for displaying transaction IDs for manual payments.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering the root component.",
  "frontend/src/pages/admin/AdminOrderDetailsPage.tsx": "Admin view for a single order with actions to verify payment, confirm, deliver, or cancel.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin table listing all orders with status, payment info, and navigation to order details.",
  "frontend/src/pages/admin/AdminProductEditPage.tsx": "Form for creating or editing a product with fields for name, description, price, images, and active status.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Renders admin product list with add, edit, and deactivate actions, including loading and empty states.",
  "frontend/src/pages/CartPage.tsx": "Displays the shopping cart, allowing quantity updates, item removal, and showing an order summary. Navigates to catalog when empty.",
  "frontend/src/pages/CatalogPage.tsx": "Fetches and displays active products with loading and error states. Shows a product grid using ProductCard components.",
  "frontend/src/pages/CheckoutPage.tsx": "Renders the checkout form if the cart has items, otherwise prompts users to return to catalog. Includes navigation back to the cart.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing a hero section, features, and a button navigating to the catalog.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays order confirmation details, customer info, items, and payment/WhatsApp actions.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Shows detailed product info, gallery, pricing, quantity selection, and add-to-cart functionality.",
  "frontend/src/state/cart.ts": "Defines a persisted Zustand store for cart items with add, remove, quantity update, total, and count helpers.",
  "frontend/src/utils/productImages.ts": "Provides helpers to normalize product image URLs and overrides images for specific products with known issues.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, and container settings with plugins for typography, queries, and animations.",
  "project_state.json": "Project metadata describing app goals, architecture notes, known issues, and implemented features."
}